Repository: appful-devteam/yabatalk
Catalog: lovetalk/Localizable.xcstrings
Source language: ja
Languages: en, es, ko, th, zh_hans

source: 1. トーク履歴にはユーザー以外の方（トーク相手）の発言、氏名、その他の個人情報が含まれています。 2. 日本の個人情報保護法に基づき、第三者の個人情報を外部サービス（Google Gemini API を含む）に提供する際は、原則としてその方の同意が必要です。AI機能（AIサマリー・返信提案・擬人化チャット）を利用する場合、トーク相手の個人情報がGoogle LLC のサーバーに送信されることをご理解ください。 3. ユーザーは、本アプリの利用にあたり、トーク相手のプライバシーに十分配慮し、必要に応じてトーク相手の同意を得る等、法令を遵守するための適切な措置を講じる責任を負います。 4. LINEの利用規約では、第三者の個人情報を不正に収集・開示・提供する行為が禁止されています。ユーザーは、LINEの利用規約を遵守した上で本アプリを利用してください。 5. トーク相手のプライバシーに関して生じた紛争、損害、請求等について、運営者は一切の責任を負いません。
en: 1. Chat history contains messages, names, and other personal information of people other than the user (chat partners). 2. Under Japan's Act on the Protection of Personal Information, consent from the individual is generally required when providing third-party personal information to external services (including Google Gemini API). 3. Users are responsible for adequately considering their chat partners' privacy and obtaining consent as needed when using this app. 4. LINE's Terms of Service prohibit unauthorized collection, disclosure, or provision of third-party personal information. Please exercise appropriate judgment regarding the use of exported chat history.
es: 1. El historial de chat contiene mensajes, nombres y otra información personal de personas distintas al usuario (compañeros de chat). 2. Según la Ley de Protección de Información Personal de Japón, generalmente se requiere el consentimiento del individuo al proporcionar información personal de terceros a servicios externos (incluida la API Google Gemini). Tenga en cuenta que al usar funciones de IA (Resumen IA, Sugerencias de Respuesta, Chat de Persona), la información personal de su compañero de chat se enviará a los servidores de Google LLC. 3. Los usuarios son responsables de considerar adecuadamente la privacidad de sus compañeros de chat y tomar las medidas apropiadas para cumplir con las leyes, incluyendo obtener el consentimiento según sea necesario. 4. Los Términos de Servicio de LINE prohíben la recopilación, divulgación o provisión no autorizada de información personal de terceros. Por favor, ejerza un juicio apropiado respecto al uso del historial de chat exportado. 5. El Operador no asume ninguna responsabilidad por disputas, daños o reclamaciones que surjan en relación con la privacidad de los compañeros de chat.
ko: 1. 대화 기록에는 사용자 이외의 사람(대화 상대)의 발언, 이름 및 기타 개인정보가 포함되어 있습니다. 2. 일본 개인정보보호법에 따라 제3자의 개인정보를 외부 서비스(Google Gemini API 포함)에 제공할 때는 원칙적으로 해당인의 동의가 필요합니다. AI 기능(AI 요약·답장 제안·의인화 채팅)을 이용하는 경우, 대화 상대의 개인정보가 Google LLC 서버로 전송된다는 점을 이해해 주세요. 3. 사용자는 본 앱 이용 시 대화 상대의 프라이버시를 충분히 배려하고, 필요에 따라 대화 상대의 동의를 얻는 등 법령을 준수하기 위한 적절한 조치를 취할 책임이 있습니다. 4. LINE 이용약관에서는 제3자의 개인정보를 무단으로 수집·공개·제공하는 행위를 금지하고 있습니다. 내보낸 대화 기록의 사용에 대해 적절한 판단을 해 주세요. 5. 대화 상대의 프라이버시와 관련하여 발생한 분쟁, 손해, 청구 등에 대해 운영자는 일체의 책임을 지지 않습니다.
zh_hans: 1. 聊天记录包含用户以外的人（聊天对象）的发言、姓名及其他个人信息。 2. 根据日本个人信息保护法，向外部服务（包括Google Gemini API）提供第三方个人信息时，原则上需要获得该方的同意。使用AI功能（AI摘要·回复建议·拟人化聊天）时，请理解聊天对象的个人信息将被发送至Google LLC的服务器。 3. 用户有责任在使用本应用时充分考虑聊天对象的隐私，并在必要时取得聊天对象的同意等，采取适当措施以遵守法律法规。 4. LINE的使用条款禁止未经授权收集、披露或提供第三方个人信息。请对导出聊天记录的使用做出适当判断。 5. 对于因聊天对象隐私相关而产生的纠纷、损害、索赔等，运营者不承担任何责任。

source: 1. トーク履歴にはユーザー以外の方（トーク相手）の発言、氏名、その他の個人情報が含まれています。\n2. 日本の個人情報保護法に基づき、第三者の個人情報を外部サービス（Google Gemini API を含む）に提供する際は、原則としてその方の同意が必要です。\n3. ユーザーは、本アプリの利用にあたり、トーク相手のプライバシーに十分配慮し、必要に応じてトーク相手の同意を得る等、法令を遵守するための適切な措置を講じる責任を負います。\n4. LINEの利用規約では、第三者の個人情報を不正に収集・開示・提供する行為が禁止されています。ユーザーは、LINEの利用規約を遵守した上で本アプリを利用してください。\n5. トーク相手のプライバシーに関して生じた紛争、損害、請求等について、運営者は一切の責任を負いません。
en: 1. Chat history contains messages, names, and other personal information of people other than the user (chat partners). 2. Under Japan's Act on the Protection of Personal Information, consent from the individual is generally required when providing third-party personal information to external services (including Google Gemini API). 3. Users are responsible for adequately considering their chat partners' privacy and taking appropriate measures to comply with laws, including obtaining consent from chat partners as needed. 4. LINE's Terms of Service prohibit the unauthorized collection, disclosure, or provision of third-party personal information. Users must comply with LINE's Terms of Service when using this app. 5. The Operator assumes no responsibility for any disputes, damages, or claims arising in relation to the privacy of chat partners.
es: 1. El historial de chat contiene mensajes, nombres y otra información personal de personas distintas al usuario (compañeros de chat). 2. Según la Ley de Protección de Información Personal de Japón, generalmente se requiere el consentimiento del individuo al proporcionar información personal de terceros a servicios externos (incluida la API Google Gemini). 3. Los usuarios son responsables de considerar adecuadamente la privacidad de sus compañeros de chat y tomar las medidas apropiadas para cumplir con las leyes, incluyendo obtener el consentimiento de los compañeros de chat según sea necesario. 4. Los Términos de Servicio de LINE prohíben la recopilación, divulgación o provisión no autorizada de información personal de terceros. Los usuarios deben cumplir con los Términos de Servicio de LINE al usar esta aplicación. 5. El Operador no asume ninguna responsabilidad por disputas, daños o reclamaciones que surjan en relación con la privacidad de los compañeros de chat.
ko: 1. 대화 기록에는 사용자 이외의 사람(대화 상대)의 발언, 이름 및 기타 개인정보가 포함되어 있습니다. 2. 일본 개인정보보호법에 따라 제3자의 개인정보를 외부 서비스(Google Gemini API 포함)에 제공할 때는 원칙적으로 해당인의 동의가 필요합니다. 3. 사용자는 본 앱 이용 시 대화 상대의 프라이버시를 충분히 배려하고, 필요에 따라 대화 상대의 동의를 얻는 등 법령을 준수하기 위한 적절한 조치를 취할 책임이 있습니다. 4. LINE 이용약관에서는 제3자의 개인정보를 무단으로 수집·공개·제공하는 행위를 금지하고 있습니다. 사용자는 LINE 이용약관을 준수한 후 본 앱을 이용해 주세요. 5. 대화 상대의 프라이버시와 관련하여 발생한 분쟁, 손해, 청구 등에 대해 운영자는 일체의 책임을 지지 않습니다.
zh_hans: 1. 聊天记录包含用户以外的人（聊天对象）的发言、姓名及其他个人信息。 2. 根据日本个人信息保护法，向外部服务（包括Google Gemini API）提供第三方个人信息时，原则上需要获得该方的同意。 3. 用户有责任在使用本应用时充分考虑聊天对象的隐私，并在必要时取得聊天对象的同意等，采取适当措施以遵守法律法规。 4. LINE的使用条款禁止未经授权收集、披露或提供第三方个人信息。用户必须在遵守LINE使用条款的前提下使用本应用。 5. 对于因聊天对象隐私相关而产生的纠纷、损害、索赔等，运营者不承担任何责任。

source: 1. ユーザーがインポートしたトーク履歴データは、原則としてユーザーのデバイス内にのみ保存されます。 2. AIサマリー機能、返信提案（相談）機能、または擬人化チャット機能を利用する場合、トーク履歴の一部（メッセージ本文、送信者名、送信日時）がGoogle LLC が提供するGemini APIのサーバーに送信されます。画像・動画・スタンプ等のメディアデータは送信されません。 3. ユーザーは、これらのAI機能の初回利用時に、データの外部送信に関する明示的な同意を行う必要があります。各機能の初回利用時に、送信されるデータの内容、送信先（Google LLC）、およびGoogleによるデータの取り扱いについて明記した同意画面が表示されます。 4. Googleによるデータの取り扱いについては、Googleのプライバシーポリシー（https://policies.google.com/privacy）およびGemini API利用規約（https://ai.google.dev/gemini-api/terms）が適用されます。Google LLC は業界標準のセキュリティ対策を講じており、送信されたデータに対して同等以上のデータ保護を提供しています。 5. AI機能を利用しない場合、トーク履歴がデバイス外に送信されることはありません。
en: 1. Imported chat history data is stored only on the user's device by default. 2. When using the AI Summary, Reply Suggestions (Consultation), or Persona Chat features, part of the chat history (message text, sender names, timestamps) is sent to Google LLC's Gemini API. 3. Media data (images, videos, stickers, etc.) is never sent. 4. Google may use the sent data for product improvement and quality review (de-identified from account information). Data may be retained on Google's servers for up to 55 days. 5. For details, see Google's Privacy Policy and Gemini API Terms of Service.
es: 1. Los datos del historial de chat importados se almacenan únicamente en el dispositivo del usuario de forma predeterminada. 2. Al utilizar las funciones de Resumen IA, Sugerencias de Respuesta (Consulta) o Chat de Persona, parte del historial de chat (texto del mensaje, nombres de remitentes, marcas de tiempo) se envía a los servidores de Gemini API de Google LLC. Los datos multimedia (imágenes, videos, stickers, etc.) nunca se envían. 3. Los usuarios deben dar su consentimiento explícito sobre la transmisión externa de datos al utilizar estas funciones de IA por primera vez. Al usar cada función por primera vez, se muestra una pantalla de consentimiento que especifica los datos a enviar, el destinatario (Google LLC) y el tratamiento de datos por parte de Google. 4. El tratamiento de datos por parte de Google se rige por la Política de Privacidad de Google (https://policies.google.com/privacy) y los Términos de Servicio de Gemini API (https://ai.google.dev/gemini-api/terms). Google LLC implementa medidas de seguridad estándar de la industria y proporciona una protección de datos equivalente o superior. 5. Si no se utilizan las funciones de IA, el historial de chat nunca se enviará fuera del dispositivo.
ko: 1. 사용자가 가져온 대화 기록 데이터는 원칙적으로 사용자 기기 내에만 저장됩니다. 2. AI 요약, 답장 제안(상담) 또는 의인화 채팅 기능을 이용하는 경우, 대화 기록의 일부(메시지 본문, 발신자 이름, 발신 시간)가 Google LLC의 Gemini API 서버로 전송됩니다. 이미지·동영상·스티커 등의 미디어 데이터는 전송되지 않습니다. 3. 사용자는 이러한 AI 기능을 처음 사용할 때 데이터 외부 전송에 대한 명시적 동의를 해야 합니다. 각 기능의 첫 사용 시 전송되는 데이터 내용, 수신처(Google LLC), Google의 데이터 처리에 대해 명시한 동의 화면이 표시됩니다. 4. Google의 데이터 처리에 대해서는 Google 개인정보 처리방침(https://policies.google.com/privacy) 및 Gemini API 이용약관(https://ai.google.dev/gemini-api/terms)이 적용됩니다. Google LLC는 업계 표준의 보안 대책을 시행하고 있으며 동등 이상의 데이터 보호를 제공합니다. 5. AI 기능을 이용하지 않는 경우, 대화 기록이 기기 외부로 전송되는 일은 없습니다.
zh_hans: 1. 用户导入的聊天记录数据原则上仅保存在用户设备内。 2. 使用AI摘要、回复建议（咨询）或拟人化聊天功能时，聊天记录的一部分（消息正文、发送者姓名、发送时间）将被发送至Google LLC的Gemini API服务器。图片、视频、贴纸等媒体数据不会被发送。 3. 用户在首次使用这些AI功能时，需要对数据的外部发送给予明确同意。首次使用各功能时，会显示明确说明发送数据内容、接收方（Google LLC）及Google数据处理方式的同意界面。 4. Google对数据的处理适用Google隐私政策（https://policies.google.com/privacy）及Gemini API服务条款（https://ai.google.dev/gemini-api/terms）。Google LLC实施行业标准的安全措施，提供同等或更高水平的数据保护。 5. 如果不使用AI功能，聊天记录不会被发送到设备之外。

source: 1. ユーザーがインポートしたトーク履歴データは、原則としてユーザーのデバイス内にのみ保存されます。 2. AIサマリー機能または返信提案機能を利用する場合、トーク履歴の一部（メッセージ本文、送信者名、送信日時）がGoogle LLC が提供するGemini APIのサーバーに送信されます。 3. ユーザーは、これらのAI機能の初回利用時に、データの外部送信に関する明示的な同意を行う必要があります。 4. Googleによるデータの取り扱いについては、Googleのプライバシーポリシー（https://policies.google.com/privacy）およびGemini API利用規約（https://ai.google.dev/gemini-api/terms）が適用されます。 5. AI機能を利用しない場合、トーク履歴がデバイス外に送信されることはありません。
en: 1. Imported chat data is stored only on user's device by default. 2. AI features send portions to Google Gemini API servers. 3. Explicit consent required on first use. 4. Google's Privacy Policy and Gemini API Terms apply. 5. Without AI features, data never leaves the device.
es: 1. Los datos se almacenan solo en el dispositivo. 2. Las funciones de IA envían datos a Google Gemini API. 3. Se requiere consentimiento explícito. 4. Se aplican las políticas de Google. 5. Sin IA, los datos no salen del dispositivo.
ko: 1. 가져온 톡 기록은 원칙적으로 기기에만 저장됩니다. 2. AI 기능 사용 시 Google Gemini API 서버로 전송됩니다. 3. 최초 사용 시 명시적 동의가 필요합니다. 4. Google의 개인정보보호정책이 적용됩니다. 5. AI 기능을 사용하지 않으면 데이터는 기기 외부로 전송되지 않습니다.
zh_hans: 1. 导入的聊天数据默认仅存储在设备中。 2. AI功能会将部分数据发送到Google Gemini API。 3. 首次使用需要明确同意。 4. 适用Google的隐私政策。 5. 不使用AI功能时数据不会离开设备。

source: 1. ユーザーがインポートしたトーク履歴データは、原則としてユーザーのデバイス内にのみ保存されます。\n2. AIサマリー機能または返信提案機能を利用する場合、トーク履歴の一部（メッセージ本文、送信者名、送信日時）がGoogle LLC が提供するGemini APIのサーバーに送信されます。\n3. ユーザーは、これらのAI機能の初回利用時に、データの外部送信に関する明示的な同意を行う必要があります。\n4. Googleによるデータの取り扱いについては、Googleのプライバシーポリシー（https://policies.google.com/privacy）およびGemini API利用規約（https://ai.google.dev/gemini-api/terms）が適用されます。\n5. AI機能を利用しない場合、トーク履歴がデバイス外に送信されることはありません。
en: 1. Imported chat history data is stored only on the user's device by default. 2. When using the AI Summary or Reply Suggestion features, part of the chat history (message text, sender names, timestamps) is sent to Google LLC's Gemini API servers. 3. Users must provide explicit consent regarding external data transmission when first using these AI features. 4. Google's handling of data is governed by Google's Privacy Policy (https://policies.google.com/privacy) and Gemini API Terms of Service (https://ai.google.dev/gemini-api/terms). 5. If AI features are not used, chat history will never be sent outside the device.
es: 1. Los datos del historial de chat importados se almacenan únicamente en el dispositivo del usuario de forma predeterminada. 2. Al utilizar las funciones de Resumen IA o Sugerencias de Respuesta, parte del historial de chat (texto del mensaje, nombres de remitentes, marcas de tiempo) se envía a los servidores de Gemini API de Google LLC. 3. Los usuarios deben dar su consentimiento explícito sobre la transmisión externa de datos al utilizar estas funciones de IA por primera vez. 4. El tratamiento de datos por parte de Google se rige por la Política de Privacidad de Google (https://policies.google.com/privacy) y los Términos de Servicio de Gemini API (https://ai.google.dev/gemini-api/terms). 5. Si no se utilizan las funciones de IA, el historial de chat nunca se enviará fuera del dispositivo.
ko: 1. 사용자가 가져온 대화 기록 데이터는 원칙적으로 사용자 기기 내에만 저장됩니다. 2. AI 요약 기능 또는 답장 제안 기능을 이용하는 경우, 대화 기록의 일부(메시지 본문, 발신자 이름, 발신 시간)가 Google LLC가 제공하는 Gemini API 서버로 전송됩니다. 3. 사용자는 이러한 AI 기능을 처음 사용할 때 데이터 외부 전송에 대한 명시적 동의를 해야 합니다. 4. Google의 데이터 처리에 대해서는 Google 개인정보 처리방침(https://policies.google.com/privacy) 및 Gemini API 이용약관(https://ai.google.dev/gemini-api/terms)이 적용됩니다. 5. AI 기능을 이용하지 않는 경우, 대화 기록이 기기 외부로 전송되는 일은 없습니다.
zh_hans: 1. 用户导入的聊天记录数据原则上仅保存在用户设备内。 2. 使用AI摘要功能或回复建议功能时，聊天记录的一部分（消息正文、发送者姓名、发送时间）将被发送至Google LLC提供的Gemini API服务器。 3. 用户在首次使用这些AI功能时，需要对数据的外部发送给予明确同意。 4. Google对数据的处理适用Google隐私政策（https://policies.google.com/privacy）及Gemini API服务条款（https://ai.google.dev/gemini-api/terms）。 5. 如果不使用AI功能，聊天记录不会被发送到设备之外。

source: 1. 収集する情報
en: 1. Information We Collect
es: 1. Información que recopilamos
ko: 1. 수집하는 정보
zh_hans: 1. 收集的信息

source: 1. 本アプリが提供する診断結果、スコア、性格分類、AI生成サマリー、および返信提案は、すべて参考情報であり、その正確性、完全性、有用性、特定目的への適合性を保証するものではありません。 2. 診断結果やAI生成コンテンツに基づくユーザーの判断や行動（人間関係に関する意思決定を含む）について、運営者は一切の責任を負いません。 3. Google Gemini API に送信されたデータの取り扱いについて、運営者は責任を負いません。データ送信後の取り扱いは Google LLC のプライバシーポリシーおよび利用規約に従います。 4. 本アプリの利用により生じたいかなる損害（直接損害、間接損害、偶発的損害、特別損害、懲罰的損害、逸失利益を含むがこれらに限定されない）についても、運営者は法令上許容される最大限の範囲で責任を負いません。 5. 本アプリは現状有姿（AS IS）で提供されます。 6. 通信環境、デバイスの状態、外部サービスの障害等に起因する本アプリの動作不良について、運営者は責任を負いません。
en: 1. All results are reference information only, with no guarantees. 2. The Operator is not responsible for user decisions based on results. 3. The Operator is not responsible for data handling by Google Gemini API. 4. The Operator shall not be liable for any damages to the maximum extent permitted by law. 5. This app is provided "AS IS." 6. The Operator is not responsible for malfunctions caused by external factors.
es: 1. Todos los resultados son solo referencia, sin garantías. 2. El Operador no es responsable de las decisiones del usuario. 3. No es responsable del manejo de datos por Google. 4. No será responsable de daños. 5. Se proporciona "TAL CUAL." 6. No es responsable de mal funcionamiento externo.
ko: 1. 모든 결과는 참고 정보로 보장하지 않습니다. 2. 운영자는 결과에 기반한 사용자 판단에 책임을 지지 않습니다. 3. Google Gemini API의 데이터 처리에 책임을 지지 않습니다. 4. 법령상 허용되는 최대 범위에서 손해에 책임을 지지 않습니다. 5. 본 앱은 현상 그대로 제공됩니다. 6. 외부 요인으로 인한 동작 불량에 책임을 지지 않습니다.
zh_hans: 1. 所有结果仅供参考，不提供任何保证。 2. 运营者不对用户基于结果的决定负责。 3. 不对Google的数据处理负责。 4. 在法律允许的最大范围内不对损害负责。 5. 本应用按"现状"提供。 6. 不对外部因素导致的故障负责。

source: 1. 本アプリが提供する診断結果、スコア、性格分類、AI生成サマリー、および返信提案は、すべて参考情報であり、その正確性、完全性、有用性、特定目的への適合性を保証するものではありません。\n2. 診断結果やAI生成コンテンツに基づくユーザーの判断や行動（人間関係に関する意思決定を含む）について、運営者は一切の責任を負いません。\n3. Google Gemini API に送信されたデータの取り扱いについて、運営者は責任を負いません。データ送信後の取り扱いは Google LLC のプライバシーポリシーおよび利用規約に従います。\n4. 本アプリの利用により生じたいかなる損害（直接損害、間接損害、偶発的損害、特別損害、懲罰的損害、逸失利益を含むがこれらに限定されない）についても、運営者は法令上許容される最大限の範囲で責任を負いません。\n5. 本アプリは現状有姿（AS IS）で提供されます。\n6. 通信環境、デバイスの状態、外部サービスの障害等に起因する本アプリの動作不良について、運営者は責任を負いません。
en: 1. All diagnostic results, scores, personality classifications, AI-generated summaries, and reply suggestions provided by this app are for reference only, and their accuracy, completeness, usefulness, or fitness for a particular purpose is not guaranteed. 2. The Operator assumes no responsibility for any judgments or actions (including decisions regarding relationships) made by users based on diagnostic results or AI-generated content. 3. The Operator is not responsible for the handling of data sent to Google Gemini API. Post-transmission data handling is governed by Google LLC's Privacy Policy and Terms of Service. 4. The Operator shall not be liable, to the maximum extent permitted by law, for any damages (including but not limited to direct, indirect, incidental, special, punitive damages, or lost profits) arising from the use of this app. 5. This app is provided "AS IS." 6. The Operator is not responsible for any malfunction of this app caused by network conditions, device status, or external service failures.
es: 1. Todos los resultados de diagnóstico, puntuaciones, clasificaciones de personalidad, resúmenes generados por IA y sugerencias de respuesta proporcionados por esta aplicación son solo de referencia, y no se garantiza su precisión, integridad, utilidad o idoneidad para un propósito particular. 2. El Operador no asume ninguna responsabilidad por los juicios o acciones (incluidas las decisiones sobre relaciones) que los usuarios tomen basándose en los resultados de diagnóstico o el contenido generado por IA. 3. El Operador no es responsable del tratamiento de los datos enviados a Google Gemini API. El tratamiento de datos posterior a la transmisión se rige por la Política de Privacidad y los Términos de Servicio de Google LLC. 4. El Operador no será responsable, en la máxima medida permitida por la ley, por ningún daño (incluidos, entre otros, daños directos, indirectos, incidentales, especiales, punitivos o lucro cesante) derivados del uso de esta aplicación. 5. Esta aplicación se proporciona "TAL CUAL." 6. El Operador no es responsable del mal funcionamiento de esta aplicación causado por las condiciones de la red, el estado del dispositivo o fallos en servicios externos.
ko: 1. 본 앱이 제공하는 진단 결과, 점수, 성격 분류, AI 생성 요약 및 답장 제안은 모두 참고 정보이며, 그 정확성, 완전성, 유용성 또는 특정 목적에의 적합성을 보증하지 않습니다. 2. 진단 결과나 AI 생성 콘텐츠에 기반한 사용자의 판단이나 행동(인간관계에 관한 의사결정 포함)에 대해 운영자는 일체의 책임을 지지 않습니다. 3. Google Gemini API에 전송된 데이터의 처리에 대해 운영자는 책임을 지지 않습니다. 데이터 전송 후의 처리는 Google LLC의 개인정보 처리방침 및 이용약관에 따릅니다. 4. 본 앱의 이용으로 인해 발생한 어떠한 손해(직접 손해, 간접 손해, 우발적 손해, 특별 손해, 징벌적 손해, 일실이익을 포함하되 이에 한정되지 않음)에 대해서도 운영자는 법령상 허용되는 최대한의 범위에서 책임을 지지 않습니다. 5. 본 앱은 현상 그대로(AS IS) 제공됩니다. 6. 통신 환경, 기기 상태, 외부 서비스 장애 등에 기인하는 본 앱의 동작 불량에 대해 운영자는 책임을 지지 않습니다.
zh_hans: 1. 本应用提供的所有诊断结果、评分、性格分类、AI生成摘要和回复建议均仅供参考，不保证其准确性、完整性、有用性或对特定目的的适用性。 2. 对于用户基于诊断结果或AI生成内容做出的判断或行为（包括有关人际关系的决策），运营者不承担任何责任。 3. 对于发送至Google Gemini API的数据的处理，运营者不承担责任。数据发送后的处理遵循Google LLC的隐私政策和服务条款。 4. 对于因使用本应用而产生的任何损害（包括但不限于直接损害、间接损害、附带损害、特殊损害、惩罚性损害或利润损失），运营者在法律允许的最大范围内不承担责任。 5. 本应用按"现状"（AS IS）提供。 6. 对于因通信环境、设备状态、外部服务故障等导致的本应用运行不良，运营者不承担责任。

source: 1. 本アプリに関するすべての知的財産権（著作権、商標権、意匠権等を含む）は、運営者または正当な権利者に帰属します。 2. ユーザーは、運営者の事前の書面による許可なく、本アプリのコンテンツ（UI、アイコン、キャラクター画像、テキスト等）を複製、転載、改変、配布、販売することはできません。 3. ユーザーが本アプリにインポートしたトーク履歴データの著作権および権利は、ユーザーおよび元の著作権者に帰属します。
en: 1. All intellectual property rights belong to the Operator or legitimate rights holders. 2. Users may not reproduce, modify, distribute, or sell app content without permission. 3. Copyright to imported chat data belongs to the user and original rights holders.
es: 1. Todos los derechos de propiedad intelectual pertenecen al Operador. 2. No se puede reproducir contenido sin permiso. 3. Los derechos de datos importados pertenecen al usuario.
ko: 1. 모든 지적재산권은 운영자에게 귀속됩니다. 2. 허가 없이 콘텐츠를 복제, 배포할 수 없습니다. 3. 가져온 데이터의 저작권은 사용자에게 귀속됩니다.
zh_hans: 1. 所有知识产权归运营者所有。 2. 未经许可不得复制、分发内容。 3. 导入数据的版权归用户所有。

source: 1. 本アプリに関するすべての知的財産権（著作権、商標権、意匠権等を含む）は、運営者または正当な権利者に帰属します。\n2. ユーザーは、運営者の事前の書面による許可なく、本アプリのコンテンツ（UI、アイコン、キャラクター画像、テキスト等）を複製、転載、改変、配布、販売することはできません。\n3. ユーザーが本アプリにインポートしたトーク履歴データの著作権および権利は、ユーザーおよび元の著作権者に帰属します。
en: 1. All intellectual property rights (including copyrights, trademarks, design rights, etc.) relating to this app belong to the Operator or legitimate rights holders. 2. Users may not reproduce, repost, modify, distribute, or sell any content of this app (UI, icons, character images, text, etc.) without prior written permission from the Operator. 3. The copyrights and rights to chat history data imported by users into this app belong to the users and the original copyright holders.
es: 1. Todos los derechos de propiedad intelectual (incluidos derechos de autor, marcas registradas, derechos de diseño, etc.) relacionados con esta aplicación pertenecen al Operador o a los titulares legítimos de los derechos. 2. Los usuarios no pueden reproducir, republicar, modificar, distribuir o vender ningún contenido de esta aplicación (interfaz, iconos, imágenes de personajes, texto, etc.) sin el permiso previo por escrito del Operador. 3. Los derechos de autor y derechos sobre los datos del historial de chat importados por los usuarios en esta aplicación pertenecen a los usuarios y a los titulares originales de los derechos de autor.
ko: 1. 본 앱에 관한 모든 지적재산권(저작권, 상표권, 디자인권 등 포함)은 운영자 또는 정당한 권리자에게 귀속됩니다. 2. 사용자는 운영자의 사전 서면 허가 없이 본 앱의 콘텐츠(UI, 아이콘, 캐릭터 이미지, 텍스트 등)를 복제, 전재, 변경, 배포, 판매할 수 없습니다. 3. 사용자가 본 앱에 가져온 대화 기록 데이터의 저작권 및 권리는 사용자 및 원저작권자에게 귀속됩니다.
zh_hans: 1. 与本应用相关的所有知识产权（包括著作权、商标权、外观设计权等）归运营者或合法权利人所有。 2. 未经运营者事先书面许可，用户不得复制、转载、修改、分发或销售本应用的任何内容（UI、图标、角色图像、文字等）。 3. 用户导入本应用的聊天记录数据的著作权及权利归用户和原著作权人所有。

source: 1. 本アプリの無料版では、Google AdMob による広告が表示される場合があります。 2. 広告の表示にあたり、Google のプライバシーポリシーが適用されます。 3. Premiumプランに加入することで、広告を非表示にすることができます。
en: 1. The free version may display ads via Google AdMob. 2. Google's privacy policy applies to ads. 3. Premium removes ads.
es: 1. La versión gratuita puede mostrar anuncios de Google AdMob. 2. Se aplica la política de privacidad de Google. 3. Premium elimina los anuncios.
ko: 1. 무료 버전에서는 Google AdMob 광고가 표시될 수 있습니다. 2. Google의 개인정보보호정책이 적용됩니다. 3. Premium으로 광고를 제거할 수 있습니다.
zh_hans: 1. 免费版可能通过Google AdMob显示广告。 2. Google的隐私政策适用。 3. Premium可去除广告。

source: 1. 本アプリの無料版では、Google AdMob による広告が表示される場合があります。\n2. 広告の表示にあたり、Google のプライバシーポリシーが適用されます。\n3. Premiumプランに加入することで、広告を非表示にすることができます。
en: 1. The free version of this app may display advertisements through Google AdMob. 2. Google's Privacy Policy applies to the display of advertisements. 3. Advertisements can be hidden by subscribing to the Premium plan.
es: 1. La versión gratuita de esta aplicación puede mostrar anuncios a través de Google AdMob. 2. La Política de Privacidad de Google se aplica a la visualización de anuncios. 3. Los anuncios pueden ocultarse suscribiéndose al plan Premium.
ko: 1. 본 앱의 무료 버전에서는 Google AdMob을 통한 광고가 표시될 수 있습니다. 2. 광고 표시에 있어 Google의 개인정보 처리방침이 적용됩니다. 3. Premium 플랜에 가입하면 광고를 숨길 수 있습니다.
zh_hans: 1. 本应用的免费版可能会通过Google AdMob显示广告。 2. Google的隐私政策适用于广告的显示。 3. 订阅Premium计划可以隐藏广告。

source: 1. 本アプリは、LINEのトーク履歴（テキスト形式）を解析し、4軸スコアリング、コミュニケーションパターン分析、性格タイプ分類、およびAI要約を提供するサービスです。 2. 本アプリが提供する診断結果、スコア、性格分類、およびAI生成サマリーは、すべて参考情報であり、科学的・医学的・心理学的な根拠に基づくものではありません。 3. 本アプリの利用にはiOS端末およびインターネット接続環境が必要です。 4. ユーザーは、自己の責任において本アプリを利用するものとします。
en: 1. This app analyzes LINE chat history to provide 4-axis scoring, communication pattern analysis, personality classification, and AI summaries. 2. All results are reference information only, not based on scientific evidence. 3. An iOS device and internet connection are required. 4. Users use this app at their own responsibility.
es: 1. Esta app analiza el historial de LINE para análisis y resúmenes de IA. 2. Todos los resultados son solo información de referencia. 3. Se requiere iOS y conexión a internet. 4. Uso bajo responsabilidad del usuario.
ko: 1. 본 앱은 LINE 톡 기록을 분석하여 4축 스코어링, 성격 분류, AI 요약을 제공합니다. 2. 모든 결과는 참고 정보입니다. 3. iOS 단말과 인터넷이 필요합니다. 4. 사용자 책임 하에 이용합니다.
zh_hans: 1. 本应用分析LINE聊天记录，提供4轴评分、性格分类和AI摘要。 2. 所有结果仅供参考。 3. 需要iOS设备和网络。 4. 用户自行承担责任。
